#字典很重要
#1增   建立字典
tel = {"jick":1390000,"mart":1380000}
#2sk 可以用构造函数dict()来创建字典
tels = dict([("maka",1399999),("gogo",1520000),("dada",15899989)])
#这种方法创建字典正方便
telss =  dict(sape=4139, guido=4127, jack=4098)
#--------------------------------------------------------------------------------------
#改  添加键值对 改
tel['guido'] = 1378888
print(tels)
print(tel)
tel['sape'] = 1369999
print(tel)
#----------------------------------------------------------------------------------------------------
#删  可以用del来删除一个键值对 删
#--------------------------------------------------------------------------------------------
del tel['sape']
print(tel)
#-------------------------------------------------------------------------------------------
#查  用in 或 not in   来查收是否在字典里,返回的是逻辑类型True和false  
print('guido' in tel)
print('maka' not in tels)
#用items()这个函数可以取出字典的键值对
for x, y in tel.items():
    print(x,y)
#在序列里面 可以用enumerate()迭代出索引和值


#

